app/views/recipes/_comment.html.erb


  <% if !!@recipe.comments.blank? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 1]]

          <h5 class="pacifico" align="left"><%= link_to comment.user.username, user_path(comment.user) %>
            <% case comment.user.recipes.count %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]