app/views/recipes/index.html.erb

SELECT "recipes".* FROM "recipes"
---
      <div class="card">
        <% if !recipe.recipe_image.blank? %>