app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(1..4) FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
---
    <strong>Rank is :</strong>
    <% case @user.recipes.count %>