app/controllers/comments_controller.rb

  def new
    @comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    #C# Added after the rest
    #Cookies
    @recipe = Recipe.find_by_id(session[:current_recipe_id])

    @comment = current_user.comments.new(comment_params)

    @comment.recipe_id = session[:current_recipe_id]
    #C#

    respond_to do |format|
      if @comment.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("title", "content", "user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Title "], ["content", "Coontetn\r\n"], ["user_id", 1], ["recipe_id", 1], ["created_at", 2016-08-08 14:17:48 UTC], ["updated_at", 2016-08-08 14:17:48 UTC]]

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
    respond_to do |format|
      format.html { redirect_to Recipe.find_by_id(session[:current_recipe_id]), notice: 'Comment was successfully destroyed.' }
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]