app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "description", "ingredients", "directions", "created_at", "updated_at", "user_id", "pictures") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", "a"], ["description", ""], ["ingredients", ""], ["directions", ""], ["created_at", 2016-08-11 15:17:29 UTC], ["updated_at", 2016-08-11 15:17:29 UTC], ["user_id", 1], ["pictures", "null"]]
---
  def create
    @recipe = current_user.recipes.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "title" = $1, "description" = $2, "preptime" = $3, "cooktime" = $4, "directions" = $5, "updated_at" = $6 WHERE "recipes"."id" = $7  [["title", "Hello"], ["description", "World"], ["preptime", 10], ["cooktime", 30], ["directions", "I like ,cheese"], ["updated_at", 2016-08-09 10:06:32 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
---
  def destroy
    #because a comment is attached to recipe, we need to delete the comments of that recipe when deleting the recipe
    @recipe.comments.each do |comment|
      comment.destroy
    end

    @recipe.destroy