app/controllers/statics_controller.rb

  def homepage
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"